Core/src/Documents/ОтчетОРозничныхПродажах/ОтчетОРозничныхПродажах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетОРозничныхПродажах</name>
  <basedOn>Document.ИнвентаризацияЗапасов</basedOn>
  <registerRecords>AccumulationRegister.ПартииТоваров</registerRecords>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоЭквайрингу</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваВКассахККМ</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыВРазрезеГТД</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ОплатаСчетовИЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиПоДисконтнымКартам</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходыКассовыйМетод</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ОплатаПлатежнымиКартами</registerRecords>
  <registerRecords>AccumulationRegister.СерийныеНомера</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыПринятые</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.ПредоставленныеАвтоматическиеСкидки</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходыКассовыйМетодЭквайринг</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АктСписанияЕГАИС</name>
    <type>
      <types>DocumentRef.АктСписанияЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСкидкиНаценки</name>
    <type>
      <types>CatalogRef.ВидыСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьМаркируемаяПродукцияГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЧекаШтрихМ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентаризацияЗапасов</name>
    <type>
      <types>DocumentRef.ИнвентаризацияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>CatalogRef.Комиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоКассовойСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСВключатьВСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКассовойСменыККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеКассовойСмены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Патент</name>
    <type>
      <types>CatalogRef.Патенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереданВЕГАИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьЗаведущегоОтделом</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьКассира</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьСтаршегоКассира</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоложениеОтветственный</name>
    <type>
      <types>EnumRef.ПоложениеРеквизитаНаФорме</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусКассовойСмены</name>
    <type>
      <types>EnumRef.СтатусыОтчетаОРозничныхПродажах</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументАвтоматическогоПроизводства</name>
    <type>
      <types>DocumentRef.СборкаЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПеремещенияНаПроизводство</name>
    <type>
      <types>DocumentRef.ПеремещениеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПеремещенияИзПроизводства</name>
    <type>
      <types>DocumentRef.ПеремещениеЗапасов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДисконтнаяКарта</name>
      <type>
        <types>CatalogRef.ДисконтныеКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Возврат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AzRyАналитикаКонтрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyПроект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyКонтрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyФормаОплаты</name>
      <type>
        <types>EnumRef.ТипыДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОплатаПлатежнымиКартами</name>
    <attributes>
      <name>ЭквайринговыйТерминал</name>
      <type>
        <types>CatalogRef.ЭквайринговыеТерминалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПлатежнойКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПлатежнойКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>22</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежа</name>
      <comment>Если не заполнено, то будет использоваться дата документа</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкидкиНаценки</name>
    <attributes>
      <name>СкидкаНаценка</name>
      <type>
        <types>CatalogRef.АвтоматическиеСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>ОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>НеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>НаЭкспорт</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыСтруктурныхЕдиниц/ТипыСтруктурныхЕдиниц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСтруктурныхЕдиниц</name>
  <enumValues>
    <name>Подразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>Розница</name>
  </enumValues>
  <enumValues>
    <name>РозницаСуммовойУчет</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыКассККМ/ТипыКассККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКассККМ</name>
  <enumValues>
    <name>ФискальныйРегистратор</name>
  </enumValues>
  <enumValues>
    <name>АвтономнаяККМ</name>
  </enumValues>
  <enumValues>
    <name>ККМOffline</name>
  </enumValues>
  <enumValues>
    <name>СервисОборудования</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ОтчетОРозничныхПродажах/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыЗаполненияДокумента

// Инициализирует документ
//
Процедура ИнициализироватьДокумент(ДанныеЗаполнения, СтратегияЗаполнения)
	
	НачалоКассовойСмены    = НачалоДня(ТекущаяДатаСеанса());
	ОкончаниеКассовойСмены = КонецДня(ТекущаяДатаСеанса());
	
	Для Каждого ТекСтратегия Из СтратегияЗаполнения Цикл
		
		Если ТипЗнч(ДанныеЗаполнения) = ТекСтратегия.Ключ Тогда
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	КассаККМ = Справочники.КассыККМ.ПолучитьКассуККМПоУмолчанию();
	Если ЗначениеЗаполнено(КассаККМ) Тогда
		// Приводим ДанныеЗаполнения для вызова обработчика ЗаполнитьДокументПоОтбору
		ДанныеЗаполнения = Новый Структура("КассаККМ, ПодписьЗаведущегоОтделом, ПодписьКассира", КассаККМ, КассаККМ.Подразделение.ПодписьМОЛ, КассаККМ.СтруктурнаяЕдиница.ПодписьМОЛ);
	КонецЕсли;
	
КонецПроцедуры // ИнициализироватьДокумент()

// Заполняет отчет о розничных продажах в соответствии с отбором.
//
// Параметры
//  ДанныеЗаполнения - Структура со значениями отбора
//
Процедура ЗаполнитьДокументПоОтбору(ДанныеЗаполнения) Экспорт
	
	Если ДанныеЗаполнения.Свойство("КассаККМ") Тогда
		ЗаполнитьДокументПоКассеККМ(ДанныеЗаполнения.КассаККМ);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьДокументПоОтбору()

// Заполняет табличную часть документа по инвентаризации товаров на складе.
//
Процедура ЗаполнитьТабличнуюЧастьЗапасыПоИнвентаризацииТоваровНаСкладе(ДанныеЗаполнения)

	ЭтотОбъект.ИнвентаризацияЗапасов = ДанныеЗаполнения.Ссылка;
	Организация = ДанныеЗаполнения.Организация;
	СтруктурнаяЕдиница = ДанныеЗаполнения.СтруктурнаяЕдиница;
	Ячейка = ДанныеЗаполнения.Ячейка;
	
	НалогообложениеНДС = УправлениеНебольшойФирмойСервер.НалогообложениеНДС(Организация, СтруктурнаяЕдиница, Дата);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МИНИМУМ(ИнвентаризацияЗапасов.НомерСтроки) КАК НомерСтроки,
	|	ИнвентаризацияЗапасов.Номенклатура КАК Номенклатура,
	|	ИнвентаризацияЗапасов.Характеристика КАК Характеристика,
	|	ИнвентаризацияЗапасов.Партия КАК Партия,
	|	ИнвентаризацияЗапасов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ИнвентаризацияЗапасов.КоличествоУчет - ИнвентаризацияЗапасов.Количество) КАК КоличествоОтклонениеИнвентаризации,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетОРозничныхПродажах.Количество ЕСТЬ NULL 
	|				ТОГДА 0
	|			ИНАЧЕ ОтчетОРозничныхПродажах.Количество
	|		КОНЕЦ) КАК КоличествоОприходованное,
	|	ИнвентаризацияЗапасов.Цена КАК Цена,
	|	ИнвентаризацияЗапасов.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	ИнвентаризацияЗапасов.КлючСвязи
	|ИЗ
	|	Документ.ИнвентаризацияЗапасов.Запасы КАК ИнвентаризацияЗапасов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах.Запасы КАК ОтчетОРозничныхПродажах
	|		ПО ИнвентаризацияЗапасов.Номенклатура = ОтчетОРозничныхПродажах.Номенклатура
	|			И ИнвентаризацияЗапасов.Характеристика = ОтчетОРозничныхПродажах.Характеристика
	|			И ИнвентаризацияЗапасов.Партия = ОтчетОРозничныхПродажах.Партия
	|			И ИнвентаризацияЗапасов.Ссылка = ОтчетОРозничныхПродажах.Ссылка.ИнвентаризацияЗапасов
	|			И (ОтчетОРозничныхПродажах.Ссылка <> &ДокументСсылка)
	|			И (ОтчетОРозничныхПродажах.Ссылка.Проведен)
	|ГДЕ
	|	ИнвентаризацияЗапасов.Ссылка = &ДокументОснование
	|	И ИнвентаризацияЗапасов.КоличествоУчет - ИнвентаризацияЗапасов.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ИнвентаризацияЗапасов.Номенклатура,
	|	ИнвентаризацияЗапасов.Характеристика,
	|	ИнвентаризацияЗапасов.Партия,
	|	ИнвентаризацияЗапасов.ЕдиницаИзмерения,
	|	ИнвентаризацияЗапасов.Цена,
	|	ИнвентаризацияЗапасов.Номенклатура.СтавкаНДС,
	|	ИнвентаризацияЗапасов.КлючСвязи
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки");
		
	Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения.Ссылка);
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
		
	РезультатЗапроса = Запрос.Выполнить();
		
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
			
		// Заполнение табличной части документа.
		Запасы.Очистить();
		
		Пока Выборка.Следующий() Цикл
			
			КоличествоОприходовать = Выборка.КоличествоОтклонениеИнвентаризации - Выборка.КоличествоОприходованное;
			Если КоличествоОприходовать <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТабличнойЧасти = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Выборка);
			СтрокаТабличнойЧасти.Количество       = КоличествоОприходовать;
			СтрокаТабличнойЧасти.Сумма 			  = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
			
			Если НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
				
				СтрокаТабличнойЧасти.СтавкаНДС = Выборка.СтавкаНДС;
				СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
				СтрокаТабличнойЧасти.СуммаНДС = ?(СуммаВключаетНДС,
												СтрокаТабличнойЧасти.Сумма
												- (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
												СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100);
			
				СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
				
			Иначе
				Если НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда	
				
					СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
				
				Иначе
				
					СтавкаНДСПоУмолчанию = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
				
				КонецЕсли;
				
				СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
				СтрокаТабличнойЧасти.СуммаНДС = 0;
			
				СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма;
				
			КонецЕсли;
			
		КонецЦикла;
				
	КонецЕсли;
		
	Если Запасы.Количество() = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ka='ინვენტარიზაციის მიხედვით შესავსებად მონაცემები არ არის!';ru='Нет данных для заполнения по инвентаризации!';en='No data to fill inventory!'");
		Сообщение.Сообщить();
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьТабличнуюЧастьТоварыПоИнвентаризацииТоваровНаСкладе()

// Заполняет документ по кассе ККМ 
//
Процедура ЗаполнитьДокументПоКассеККМ(КассаККМ)
	
	РеквизитыКассыККМ = Справочники.КассыККМ.ПолучитьРеквизитыКассыККМ(КассаККМ);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыКассыККМ);
	НалогообложениеНДС = УправлениеНебольшойФирмойСервер.НалогообложениеНДС(Организация, СтруктурнаяЕдиница, Дата);
	
КонецПроцедуры // ЗаполнитьДокументПоКассеККМ()

// Заполняет документ по кассе ККМ склада если Касса ККМ на складе одна.
//
Процедура ЗаполнитьДокументПоСкладу(СтруктурнаяЕдиница)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	КассыККМ.Ссылка КАК КассаККМ
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|ГДЕ
	|	КассыККМ.СтруктурнаяЕдиница = &СтруктурнаяЕдиница";
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1
		И Выборка.Следующий()
		Тогда
		КассаККМ = Выборка.КассаККМ;
		ЗаполнитьДокументПоКассеККМ(КассаККМ);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьДокументПоСкладу()

// Заполняет отчет о розничных продажах на основании документа инвентаризация товаров на складе.
//
// Параметры
//  ДанныеЗаполнения - Структура со значениями отбора
//
Процедура ЗаполнитьПоИнвентаризацииЗапасовНаСкладе(ДанныеЗаполнения) Экспорт
	
	Если ДанныеЗаполнения.СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы <> Перечисления.ТипыСтруктурныхЕдиниц.Розница Тогда
		ВызватьИсключение(НСтр("ka='დოკუმენტი შეიძლება შეივსოს მხოლოდ საცალო საწყობის მიხედვით ინვენტარიზაციის საფუძველზე!';ru='Документ может быть заполнен только на основании инвентаризации по розничному складу!';en='The document can only be filled on the basis of the inventory at retail warehouse!'"));
	КонецЕсли;
	
	СтруктурнаяЕдиница            = ДанныеЗаполнения.СтруктурнаяЕдиница;
	ИнвентаризацияТоваровНаСкладе = ДанныеЗаполнения.Ссылка;
	
	ЗаполнитьДокументПоСкладу(СтруктурнаяЕдиница);
	
	ЗаполнитьТабличнуюЧастьЗапасыПоИнвентаризацииТоваровНаСкладе(ДанныеЗаполнения);
	
КонецПроцедуры // ЗаполнитьПоИнвентаризацииТоваровНаСкладе()

// Добавляет дополнительные реквизиты, необходимые для проведения документа в
// переданную структуру.
//
// Параметры:
//  СтруктураДополнительныеСвойства - Структура дополнительных свойств документа.
//
Процедура ДобавитьРеквизитыВДополнительныеСвойстваДляПроведения(СтруктураДополнительныеСвойства)
	
	Если КассаККМ.ТипКассы = Перечисления.ТипыКассККМ.ФискальныйРегистратор Тогда
		ПолноеПроведение = СтатусКассовойСмены = Перечисления.СтатусыОтчетаОРозничныхПродажах.ЗакрытаЧекиЗаархивированы;
	Иначе
		ПолноеПроведение = (СтатусКассовойСмены = Перечисления.СтатусыОтчетаОРозничныхПродажах.ЗакрытаЧекиЗаархивированы)
					   ИЛИ (СтатусКассовойСмены = Перечисления.СтатусыОтчетаОРозничныхПродажах.Закрыта);
	КонецЕсли;
	
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("ПолноеПроведение", ПолноеПроведение);
	
КонецПроцедуры // ДобавитьРеквизитыВДополнительныеСвойстваДляПроведения()

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьДокументПоОтбору";
	СтратегияЗаполнения[Тип("ДокументСсылка.ИнвентаризацияЗапасов")] = "ЗаполнитьПоИнвентаризацииЗапасовНаСкладе";
	
	ИнициализироватьДокумент(ДанныеЗаполнения, СтратегияЗаполнения);
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения, "ВидЦен");
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//+++ Дмгг
	Если НЕ Проведен  и РежимЗаписи = РежимЗаписиДокумента.Проведение   Тогда 
		АвтоматическоеПроизводствоНедостающихТоваров(Отказ);
	КонецЕсли;
	//--- Дмгг
	
	Если ПоложениеОтветственный = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
		Для каждого СтрокаТабличнойЧасти Из Запасы Цикл
			СтрокаТабличнойЧасти.Ответственный = Ответственный;
		КонецЦикла;
	КонецЕсли;
	
	СуммаДокумента = Запасы.Итог("Всего");
	
	//+ ГИСМ
	ЕстьМаркируемаяПродукцияГИСМ = ИнтеграцияГИСМУНФ.ЕстьМаркируемаяПродукцияГИСМ(Запасы);
	//- ГИСМ
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ОбработкаПроверкиЗаполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ТипКассы = Справочники.КассыККМ.ПолучитьРеквизитыКассыККМ(КассаККМ).ТипКассы;
	
	Если ОплатаПлатежнымиКартами.Итог("Сумма") > СуммаДокумента Тогда
		
		ТекстОшибки = НСтр("ka='გადახდის ბარათებით გადახდის თანხა აღემატება დოკუმენტის თანხას';ru='Сумма оплаты платежными картами превышает сумму документа';en='payment cards payment amount exceeds the sum of the document'");
		
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			ЭтотОбъект,
			ТекстОшибки,
			Неопределено,
			Неопределено,
			"ОплатаПлатежнымиКартами",
			Отказ
		);
		
	КонецЕсли;
	
	Если ТипКассы = Перечисления.ТипыКассККМ.ФискальныйРегистратор
		И НЕ ЗначениеЗаполнено(КассоваяСмена) Тогда
		
		ОткрытаяКассоваяСмена = Документы.ОтчетОРозничныхПродажах.ПолучитьОткрытуюКассовуюСмену(КассаККМ, Ссылка, НачалоКассовойСмены, ОкончаниеКассовойСмены);
		Если ОткрытаяКассоваяСмена <> Неопределено
		   И ОткрытаяКассоваяСмена <> Ссылка Тогда
			
			ТекстОшибки = НСтр("ka='მოცემული სალაროთი თარიღზე %Дата% უკვე დარეგისტრირებულია %КассоваяСмена%';ru='По данной кассе на дату %Дата% уже зарегистрирован %КассоваяСмена%';en='For this office to date%% date% is already registered KassovayaSmena%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Дата);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%КассоваяСмена%", ОткрытаяКассоваяСмена);
			
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ЭтотОбъект,
				ТекстОшибки,
				Неопределено,
				Неопределено,
				"",
				Отказ
			);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОкончаниеКассовойСмены)
			 И ЗначениеЗаполнено(СтатусКассовойСмены)
			 И СтатусКассовойСмены <> Перечисления.СтатусыОтчетаОРозничныхПродажах.Открыта Тогда
			
			ТекстОшибки = НСтр("ka='ველი ""ცვლის დასრულება"" შეუვსებელია';ru='Поле ""Окончание смены"" не заполнено';en='The ""End of change"" not filled'");
			
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ЭтотОбъект,
				ТекстОшибки,
				Неопределено,
				Неопределено,
				"ОкончаниеКассовойСмены",
				Отказ
			);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОкончаниеКассовойСмены)
			 И ОкончаниеКассовойСмены < НачалоКассовойСмены Тогда
			
			ТекстОшибки = НСтр("ka='სალაროს ცვლის დაწყების დრო მეტია სალაროს ცვლის დასრულების დროზე';ru='Время начала кассовой смены больше времени окончания кассовой смены';en='The start time of the cash change over the end of the cash change'");
			
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ЭтотОбъект,
				ТекстОшибки,
				Неопределено,
				Неопределено,
				"ОкончаниеКассовойСмены",
				Отказ
			);
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(СтатусКассовойСмены)
			 И СтатусКассовойСмены = Перечисления.СтатусыОтчетаОРозничныхПродажах.Открыта
			 И НачалоКассовойСмены <> Дата Тогда
			
			ТекстОшибки = НСтр("ka='სალაროს ცვლის დაწყების დრო განსხვავდება დოკუმენტის თარიღისგან';ru='Время начала кассовой смены отличается от даты документа';en='The start time is different from cash change date of the document'");
			
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ЭтотОбъект,
				ТекстОшибки,
				Неопределено,
				Неопределено,
				"НачалоКассовойСмены",
				Отказ
			); 
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтатусКассовойСмены)
			 И СтатусКассовойСмены <> Перечисления.СтатусыОтчетаОРозничныхПродажах.Открыта
			 И ОкончаниеКассовойСмены <> Дата Тогда
			
			ТекстОшибки = НСтр("ka='სალაროს ცვლის დასრულების დრო განსხვავდება დოკუმენტის თარიღისგან';ru='Время окончания кассовой смены отличается от даты документа';en='End time cash change differs from the date of the document'");
			
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ЭтотОбъект,
				ТекстОшибки,
				Неопределено,
				Неопределено,
				"ОкончаниеКассовойСмены",
				Отказ
			);
			
		КонецЕсли;
	
	КонецЕсли;
	
	// Скидка 100%.
	Если Константы.ФункциональнаяОпцияИспользоватьРучныеСкидкиНаценкиПродажи.Получить() Тогда
		Для каждого СтрокаЗапасы Из Запасы Цикл
			Если СтрокаЗапасы.ПроцентСкидкиНаценки < 100 
				И НЕ ЗначениеЗаполнено(СтрокаЗапасы.Сумма)
				И (СтрокаЗапасы.Резерв = 0 И 
					ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыВРозничнойТорговле") И 
					ПолучитьФункциональнуюОпцию("РезервированиеЗапасов"))
				Тогда
				ТекстСообщения = НСтр("ka='არ არის შევსებული სვეტი ""თანხა"" სია ""მარაგები""-ს სტრიქონ %Номер%-ში.';ru='Не заполнена колонка ""Сумма"" в строке %Номер% списка ""Запасы"".';en='Not filled column ""Amount"" on line% number% list ""Inventories"".'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номер%", СтрокаЗапасы.НомерСтроки);
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					"Запасы",
					СтрокаЗапасы.НомерСтроки,
					"Сумма",
					Отказ
				);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Заказы покупателей в рознице
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыВРозничнойТорговле") И ПолучитьФункциональнуюОпцию("РезервированиеЗапасов") Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Запасы.Количество"));
		
		Для каждого СтрокаЗапасы Из Запасы Цикл
			Если СтрокаЗапасы.Количество = 0 И СтрокаЗапасы.Резерв = 0 Тогда
				ТекстСообщения = НСтр("ka='სია ""მარაგები""-ს სტრიქონ %Номер%-ში სვეტი ""რაოდენობა"" არ არის შევსებული.';ru='Не заполнена колонка ""Количество"" в строке %Номер% списка ""Запасы"".';en='Not filled column ""Number"" on line% number% list ""Inventories"".'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номер%", СтрокаЗапасы.НомерСтроки);
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					"Запасы",
					СтрокаЗапасы.НомерСтроки,
					"Количество",
					Отказ
				);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для каждого СтрокаЗапасы Из Запасы Цикл
			Если СтрокаЗапасы.Количество <= 0 Тогда
				ТекстСообщения = НСтр("ka='სია ""მარაგები""-ს სტრიქონ %Номер%-ში სვეტი ""რაოდენობა"" არასწორად არის შევსებული.';ru='Не верно заполнена колонка ""Количество"" в строке %Номер% списка ""Запасы"".';en='Field filled not right column ""Number"" on line% number% list ""Inventories"".'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Номер%", СтрокаЗапасы.НомерСтроки);
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
					ЭтотОбъект,
					ТекстСообщения,
					"Запасы",
					СтрокаЗапасы.НомерСтроки,
					"Количество",
					Отказ
				);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// Конец Заказы покупателей в рознице
	
	// Серийные номера
	РаботаССерийнымиНомерами.ПроверкаЗаполненияСерийныхНомеров(Отказ, Запасы, СерийныеНомера, СтруктурнаяЕдиница, ЭтотОбъект);
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Процедура - обработчик события ОбработкаПроведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	ДобавитьРеквизитыВДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.ОтчетОРозничныхПродажах.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыВРазрезеГТД(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьПродажи(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыНаСкладах(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыКассовыйМетод(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДенежныеСредстваВКассахККМ(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасыПринятые(ДополнительныеСвойства, Движения, Отказ);
	
	// ДисконтныеКарты
	УправлениеНебольшойФирмойСервер.ОтразитьПродажиПоДисконтнойКарте(ДополнительныеСвойства, Движения, Отказ);
	
	// СерийныеНомера
	УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераОстатки(ДополнительныеСвойства, Движения, Отказ);
	
	// АвтоматическиеСкидки
	УправлениеНебольшойФирмойСервер.ОтразитьПредоставленныеАвтоматическиеСкидки(ДополнительныеСвойства, Движения, Отказ);
	// Эквайринг
	УправлениеНебольшойФирмойСервер.ОтразитьОплатаПлатежнымиКартами(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыПоЭквайрингу(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходыКассовыйМетодЭквайринг(ДополнительныеСвойства, Движения, Отказ);
	// Конец Эквайринг
	
	УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
	// Щербаков +++
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	// Щербаков ---
	
	// Заказ покупателя в розничной торговле
	УправлениеНебольшойФирмойСервер.ОтразитьЗаказыПокупателей(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьОплатаСчетовИЗаказов(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.ОтчетОРозничныхПродажах.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события ОбработкаУдаленияПроведения.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.ОтчетОРозничныхПродажах.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

//+++ Дмгг
Процедура АвтоматическоеПроизводствоНедостающихТоваров(Отказ)

	Если ЗначениеЗаполнено(ДокументАвтоматическогоПроизводства) Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("АвтоматическоеСозданияПроизводстваПриНедостачиКассовойСмены") Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетОРозничныхПродажахЗапасы.Номенклатура КАК Номенклатура,
		|	ОтчетОРозничныхПродажахЗапасы.Характеристика КАК Характеристика,
		|	ОтчетОРозничныхПродажахЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ОтчетОРозничныхПродажахЗапасы.Количество КАК Количество,
		|	&Организация
		|ПОМЕСТИТЬ ВременнаяТаблицаОтчет
		|ИЗ
		|	&тзЗапасы КАК ОтчетОРозничныхПродажахЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ВременнаяТаблицаОтчет.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВременнаяТаблицаОтчет.Характеристика КАК Характеристика,
		|	ВременнаяТаблицаОтчет.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВременнаяТаблицаОтчет.Количество КАК Количество,
		|	Спецификации.Ссылка КАК Спецификация,
		|	ВременнаяТаблицаОтчет.Организация
		|ПОМЕСТИТЬ ВТ_НоменклатурыПроизводства
		|ИЗ
		|	ВременнаяТаблицаОтчет КАК ВременнаяТаблицаОтчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Спецификации КАК Спецификации
		|		ПО ВременнаяТаблицаОтчет.Номенклатура = Спецификации.Владелец
		|			И ВременнаяТаблицаОтчет.Характеристика = Спецификации.ХарактеристикаПродукции
		|ГДЕ
		|	ВЫРАЗИТЬ(ВременнаяТаблицаОтчет.Номенклатура КАК Справочник.Номенклатура).СпособПополнения = ЗНАЧЕНИЕ(Перечисление.СпособыПополненияЗапасов.Производство)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НоменклатурыПроизводства.Номенклатура,
		|	ВТ_НоменклатурыПроизводства.Характеристика,
		|	ВТ_НоменклатурыПроизводства.ЕдиницаИзмерения,
		|	-(ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) - ВТ_НоменклатурыПроизводства.Количество) КАК Количество,
		|	ВТ_НоменклатурыПроизводства.Спецификация
		|ИЗ
		|	ВТ_НоменклатурыПроизводства КАК ВТ_НоменклатурыПроизводства
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(
		|				&НаДату,
		|				СчетУчетаРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Запасы)
		|					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ЗапасыОстатки
		|		ПО ВТ_НоменклатурыПроизводства.Номенклатура = ЗапасыОстатки.Номенклатура
		|			И ВТ_НоменклатурыПроизводства.Характеристика = ЗапасыОстатки.Характеристика
		|			И ВТ_НоменклатурыПроизводства.Организация = ЗапасыОстатки.Организация
		|ГДЕ
		|	ЕСТЬNULL(ЗапасыОстатки.КоличествоОстаток, 0) - ВТ_НоменклатурыПроизводства.Количество < 0";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("тзЗапасы", Запасы.Выгрузить());
	Запрос.УстановитьПараметр("НаДату", Новый Граница(Новый МоментВремени(Дата),	ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница.СкладПроизводства) Тогда 
		ТекстСообщения = "В Структурной еденице не заполнен реквизит ""Склад производства""";
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения,,,,Отказ);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СборкаЗапасов = Документы.СборкаЗапасов.СоздатьДокумент();
	СборкаЗапасов.Автор = Автор;
	СборкаЗапасов.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
	
	СборкаЗапасов.Дата = Дата - 120;
	СборкаЗапасов.ВидОперации = Перечисления.ВидыОперацийСборкаЗапасов.Сборка;
	СборкаЗапасов.Организация = Справочники.Организации.ОсновнаяОрганизация;
	СборкаЗапасов.СтруктурнаяЕдиницаПродукции = СтруктурнаяЕдиница.СкладПроизводства;
	СборкаЗапасов.СтруктурнаяЕдиница = Подразделение;
	СборкаЗапасов.СтруктурнаяЕдиницаОтходов = СтруктурнаяЕдиница.СкладПроизводства;
	СборкаЗапасов.СтруктурнаяЕдиницаЗапасов = СтруктурнаяЕдиница.СкладПроизводства;
	
	СборкаЗапасов.Продукция.Загрузить(РезультатЗапроса);
	
	СтекСпецификацийУзлов = Новый Массив;
	СборкаЗапасов.ЗаполнитьТабличнуюЧастьПоСпецификации(СтекСпецификацийУзлов);
	
	///////////////////////////
	ПеремещениеНаПроизводство = Документы.ПеремещениеЗапасов.СоздатьДокумент();
	ПеремещениеНаПроизводство.Автор = Автор;
	ПеремещениеНаПроизводство.Дата = Дата - 180; 
	ПеремещениеНаПроизводство.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение;
	ПеремещениеНаПроизводство.Организация = Организация;
	ПеремещениеНаПроизводство.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
	ПеремещениеНаПроизводство.СтруктурнаяЕдиницаПолучатель = СтруктурнаяЕдиница.СкладПроизводства;	
	
	ПеремещениеНаПроизводство.Запасы.Загрузить(СборкаЗапасов.Запасы.Выгрузить());
	
	/////////////////////////
	
	ПеремещениеИзПроизводство = Документы.ПеремещениеЗапасов.СоздатьДокумент();
	ПеремещениеИзПроизводство.Автор = Автор;
	ПеремещениеИзПроизводство.Дата = Дата - 60; 
	ПеремещениеИзПроизводство.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение;
	ПеремещениеИзПроизводство.Организация = Организация;
	ПеремещениеИзПроизводство.СтруктурнаяЕдиница = СтруктурнаяЕдиница.СкладПроизводства;
	ПеремещениеИзПроизводство.СтруктурнаяЕдиницаПолучатель = СтруктурнаяЕдиница;	
	
	ПеремещениеИзПроизводство.Запасы.Загрузить(СборкаЗапасов.Продукция.Выгрузить());
	
	Попытка
		ПеремещениеНаПроизводство.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	Исключение
		Сообщить(ОписаниеОшибки());
		ПеремещениеНаПроизводство.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("НеУдалосьПровестиДокументПроизводства: " + ПеремещениеНаПроизводство.Ссылка);
	КонецПопытки;
	
	Попытка
		СборкаЗапасов.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	Исключение
		Сообщить(ОписаниеОшибки());
		СборкаЗапасов.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("НеУдалосьПровестиДокументПроизводства: " + СборкаЗапасов.Ссылка);
	КонецПопытки;
	
	Попытка
		ПеремещениеИзПроизводство.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	Исключение
		Сообщить(ОписаниеОшибки());
		ПеремещениеИзПроизводство.Записать(РежимЗаписиДокумента.Запись);
		Сообщить("НеУдалосьПровестиДокументПроизводства: " + ПеремещениеИзПроизводство.Ссылка);
	КонецПопытки;
	
	ДокументАвтоматическогоПроизводства = СборкаЗапасов.Ссылка;
	ДокументПеремещенияНаПроизводство   = ПеремещениеНаПроизводство.Ссылка;
	ДокументПеремещенияИзПроизводства   = ПеремещениеИзПроизводство.Ссылка;
КонецПроцедуры
//--- Дмгг

#КонецОбласти

#КонецЕсли
